<?php

/*1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка*/

$num = 1;
while ($num < 100) {
	if ($num % 3 == 0) {
		echo $num++ . ' ';
	}
	$num++;
}

?>
</br>

<?php

/*2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
0 – ноль.
1 – нечетное число.
2 – четное число.
3 – нечетное число.
…
10 – четное число.*/

$num = 0;
do {
	if ($num == 0) {
		echo $num . ' - ноль.' . '<br>';
		$num++;
	} else if ($num % 2 != 0) {
		echo $num . ' - нечетное число.' . '<br>';
		$num++;
	} else {
		echo $num . ' - четное число.' . '<br>';
		$num++;
	}
}
while ($num <11);

?>
</br>

<?php

/*3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:
Московская область: Москва, Зеленоград, Клин
Ленинградская область: Санкт-Петербург, Всеволожск, Павловск, Кронштадт
Рязанская область: … (названия городов можно найти на maps.yandex.ru)*/

$areaArr = [
    'Московская область:' 		=> ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область:' 	=> ['Санкт-Петербург', 'Всеволожск', 'Павловск'],
    'Рязанская область:' 		=> ['Захарово', 'Михайлово', 'Скопин']
];

function displayCity($arr) {
	if (!is_array($arr)) {
		return print "аргумент не верен '{$arr}'";
	}
	foreach ($arr as $key => $value) {
		echo $key;
		for ($i=0; $i < $arrLength = count($arr[$key]); $i++) { 
			if ($i == $arrLength - 1) {
				echo $arr[$key][$i] . '.' . '<br>';
			} else {
				echo $arr[$key][$i] . ', ';
			}
		}
	}
}
displayCity($areaArr);

?>
</br>

<?php

/*4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
Написать функцию транслитерации строк.*/

function translit($string){
	$letters = array("а" => "a", 
					 "б" => "b", 
					 "в" => "v", 
					 "г" => "g", 
					 "д" => "d", 
					 "е" => "e", 
					 "ё" => "yo",
					 "ж" => "zh", 
					 "з" => "z", 
					 "и" => "i", 
					 "й" => "y", 
					 "к" => "k", 
					 "л" => "l", 
					 "м" => "m",
					 "н" => "n", 
					 "о" => "o", 
					 "п" => "p", 
					 "р" => "r", 
					 "с" => "s", 
					 "т" => "t", 
					 "у" => "u",
					 "ф" => "f", 
					 "х" => "h", 
					 "ц" => "ts", 
					 "ч" => "ch", 
					 "ш" => "sh", 
					 "щ" => "s'h", 
					 "ъ" => "",
					 "ы" => "i", 
					 "ь" => "'", 
					 "э" => "e", 
					 "ю" => "yu", 
					 "я" => "ya", 
					 " " => " "
					);
 	$word = strtr($string, $letters);
	echo "$word \r\n";	
};
 
translit("привет");

?>
</br>

<?php

/*5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку..*/

function replace($word) {
	echo str_replace(" ", "_", $word);
};
 
replace("Пришел увидел победил");

?>
</br>

<?php

/*7. *Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла. Выглядеть должно так:
for (…){ // здесь пусто}*/

for ($i = 0; $i < 10; print $i++ .' ') {};

?>
</br>

<?php

/*8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».*/

$areaArr = [
    'Московская область:' 		=> ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область:' 	=> ['Санкт-Петербург', 'Всеволожск', 'Кронштадт'],
    'Рязанская область:' 		=> ['Захарово', 'Михайлово', 'Скопин']
];

foreach ($areaArr as $key => $value) {
	echo $key . ' ';
	foreach ($value as $key => $value) {
		if(mb_substr($value, 0, 1) == 'К') {
			echo $value . ';' . '<br>';
		}
	}
}	

?>
</br>

<?php

/*9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах).*/

function repl_transl($string) {
	$aLetters = array(
		"а" => "a", 
		"б" => "b", 
		"в" => "v", 
		"г" => "g", 
		"д" => "d", 
		"е" => "e", 
		"ё" => "yo",
		"ж" => "zh", 
		"з" => "z", 
		"и" => "i", 
		"й" => "y", 
		"к" => "k", 
		"л" => "l", 
		"м" => "m",
		"н" => "n", 
		"о" => "o", 
		"п" => "p", 
		"р" => "r", 
		"с" => "s", 
		"т" => "t", 
		"у" => "u",
		"ф" => "f", 
		"х" => "h", 
		"ц" => "ts", 
		"ч" => "ch", 
		"ш" => "sh", 
		"щ" => "s'h", 
		"ъ" => "'",
		"ы" => "i", 
		"ь" => "'", 
		"э" => "e", 
		"ю" => "yu", 
		"я" => "ya", 
		" " => " "
	);
 
	$word = strtr($string, $aLetters);
	echo str_replace(" ", "_", $word);
};
repl_transl("проверка конечного вариата!");

?>